# From SQL to Pandas Challenges 5

In [ ]:
# import libraries
import pandas as pd

# load data
# This code is made to load our data stored on Google Drive
def gd_path(file_id):
    """Generate a shareable link from Google Drive file id."""
    return f"https://drive.google.com/uc?export=download&id={file_id}"

# Google Drive file ids
files_id = {
    "titleauthor": "1F1JOiYXStWacOBca6coNVfyVtoST7ZgD",
    "titles": "1PLdn50N9GRa53ZbuVWo0l47F_IXdvlEm",
    "stores": "1f-GCgip7O93CpbAkYvOsc21eKnSOSHsQ", 
    "sales": "1fzFc9rwYmVIPaGOFmhLVxCi3kg19vNU2", 
    "roysched": "1zPRZPoFPEMKyrNR5VSENeYFHGCBZmxbs", 
    "publishers": "1s9E8_AVOziTrowb3wyh2jg3PV763VOyq",
    "pub_info": "1OEgogcGKy--EpuVj0kqq7lyBZNGW6YSv", 
    "jobs": "1V1Za8hUdXD-vJOyRdX4aQV5wanIff2eM", 
    "employee": "1h9mUjsVqpP74b1w0x7KOw37n_n9Ulkt5", 
    "discounts": "111dvSxMcCsTgOuV1wDSKFJxO1Xcxd9VS", 
    "authors": "1fEF89Nhe61EebAljKlwFwfEuokK0o6aJ"
}

# Read data from Google Drive
authors = pd.read_csv(gd_path(files_id["authors"]), sep=";")
titles = pd.read_csv(gd_path(files_id["titles"]), sep=";")
stores = pd.read_csv(gd_path(files_id["stores"]), sep=";")
employee = pd.read_csv(gd_path(files_id["employee"]), sep=";")

## 1. Select all books from the table `titles` that contain the word "cooking" in its title

In [ ]:
(
titles
    # str.contains() looks for any occurences of the provided pattern in the string.
    # In difference to SQLs LIKE, wildcard characters are often not necessary.
    .loc[titles['title'].str.contains('cooking', case = False)]
)

,title_id,title,type,pub_id,price,advance,royalty,ytd_sales,notes,pubdate
1,BU1111,Cooking with Computers: Surreptitious Balance ...,business,1389,11.95,5000.0,10,3876,Helpful hints on how to use your electronic re...,1991-06-09 00:00:00
6,MC3026,The Psychology of Computer Cooking,UNDECIDED,877,0.00,0.0,0,0,NaN,2014-11-07 10:39:37
15,TC3218,"Onions, Leeks, and Garlic: Cooking Secrets of ...",trad_cook,877,20.95,7000.0,10,375,"Profusely illustrated in color, this makes a w...",1991-10-21 00:00:00

### Hint:

In SQL the syntax is:

```sql
SELECT title
FROM titles
WHERE title LIKE '%cooking%';
```

## 2. Select all titles that start with the word "The"

In [ ]:
(
titles
    # str.contains() can use a "regular expression" (regex)
    # This lets us look for the beginning and ending of strings, wildcard characters and much more
    .loc[titles['title'].str.contains('^The', regex = True)]
)

,title_id,title,type,pub_id,price,advance,royalty,ytd_sales,notes,pubdate
0,BU1032,The Busy Executive's Database Guide,business,1389,19.99,5000.0,10,4095,An overview of available database systems with...,1991-06-12 00:00:00
5,MC3021,The Gourmet Microwave,mod_cook,877,2.99,15000.0,24,22246,Traditional French gourmet recipes adapted for...,1991-06-18 00:00:00
6,MC3026,The Psychology of Computer Cooking,UNDECIDED,877,0.00,0.0,0,0,NaN,2014-11-07 10:39:37

### Hint:

In SQL the syntax is:

```sql
SELECT title
FROM titles
WHERE title LIKE 'The%';
```

## 3. Select the full names (first and last name) of authors whose last name starts with "S"

In [ ]:
(
authors
    [['au_fname', 'au_lname']]
    # Within a regular expression '^' denotes the start of the string.
    .loc[authors['au_lname'].str.contains('^S', regex=True)]
)

   au_fname  au_lname
4      Dean  Straight
5   Meander     Smith
15     Dirk  Stringer

### Hint:

In SQL the syntax is:

```sql
SELECT au_fname, au_lname 
FROM authors
WHERE au_lname LIKE('S%');
```

## 4. Select the name and address of all stores located in an Avenue (its address ends with "Ave.")

In [ ]:
(
stores
    # Within a regular expression '$' denotes the end of the string.
    .loc[stores['stor_address'].str.contains('Ave\.$', regex = True)]
)

   stor_id            stor_name         stor_address     city state    zip
0     6380  Eric the Read Books  788 Catamaugus Ave.  Seattle    WA  98056
1     7066             Barnum's    567 Pasadena Ave.   Tustin    CA  92789

### Hint:

In SQL the syntax is:

```sql
SELECT stor_name, stor_address
FROM stores
WHERE stor_address LIKE ("%Ave.");
```

## 5. Select the name and address of all stores located in an Avenue or in a Street (address ended in "St.")

In [ ]:
(
stores
    .loc[(stores['stor_address'].str.contains('Ave\.$', regex = True))
        |(stores['stor_address'].str.contains('St\.$', regex = True))]
    [['stor_name', 'stor_address']]
)

             stor_name         stor_address
0  Eric the Read Books  788 Catamaugus Ave.
1             Barnum's    567 Pasadena Ave.
2         News & Brews        577 First St.
4   Fricative Bookshop       89 Madison St.
5             Bookbeat       679 Carson St.

### Hint:

In SQL the syntax is:

```sql
SELECT
	stor_name,
	stor_address
FROM
	stores
WHERE 
	stor_address LIKE '%St.' 
    OR stor_address LIKE '%Ave.';
```

## 6. Look at the "employee" table (select all columns to explore the raw data):
   Find a pattern that reveals whether an employee is Female or Male.
   Select all female employees.

In [ ]:
(
employee
    .loc[employee['emp_id'].str.contains('F$', regex=True)]
)

,emp_id,fname,minit,lname,job_id,job_lvl,pub_id,hire_date
0,A-C71970F,Aria,NaN,Cruz,10,87,1389,1991-10-26 00:00:00
1,A-R89858F,Annette,NaN,Roulet,6,152,9999,1990-02-21 00:00:00
2,AMD15433F,Ann,M,Devon,3,200,9952,1991-07-16 00:00:00
3,ARD36773F,Anabela,R,Domingues,8,100,877,1993-01-27 00:00:00
5,CGS88322F,Carine,G,Schmitt,13,64,1389,1992-07-07 00:00:00
8,ENL44273F,Elizabeth,N,Lincoln,14,35,877,1990-07-24 00:00:00
11,H-B39728F,Helen,NaN,Bennett,12,35,877,1989-09-21 00:00:00
14,JYL26161F,Janine,Y,Labrune,5,172,9901,1991-05-26 00:00:00
15,KFJ64308F,Karin,F,Josephs,14,100,736,1992-10-17 00:00:00
16,KJJ92907F,Karla,J,Jablonski,9,170,9999,1994-03-11 00:00:00
17,L-B31947F,Lesley,NaN,Brown,7,120,877,1991-02-13 00:00:00
19,M-L67958F,Maria,NaN,Larsson,7,135,1389,1992-03-27 00:00:00
21,M-R38834F,Martine,NaN,Rance,9,75,877,1992-02-05 00:00:00
23,MAS70474F,Margaret,A,Smith,9,78,1389,1988-09-29 00:00:00
27,MMS49649F,Mary,M,Saveley,8,175,736,1993-06-29 00:00:00
28,PCM98509F,Patricia,C,McKenna,11,150,9999,1989-08-01 00:00:00
34,PSP68661F,Paula,S,Parente,8,125,1389,1994-01-19 00:00:00
38,RBM23061F,Rita,B,Muller,5,198,1622,1993-10-09 00:00:00
41,VPA30890F,Victoria,P,Ashworth,6,140,877,1990-09-13 00:00:00

### Hint:

In SQL the syntax is:

```sql
SELECT emp_id, fname,lname 
FROM employee 
WHERE emp_id LIKE ('%F');
```

## 7. Select the first and last names of all male employees whose name starts with "P".

In [ ]:
(
employee
    .loc[employee['emp_id'].str.contains('M$', regex=True)
        &(employee['fname'].str.contains('^P', regex=True)
        |employee['lname'].str.contains('^P', regex=True))]
    [['fname', 'lname']]
)

     fname      lname
20  Manuel    Pereira
22  Miguel    Paolino
26   Maria     Pontes
29   Palle      Ibsen
30   Peter    Franken
31   Paolo    Accorti
32  Pirkko  Koskitalo
33   Pedro     Afonso
35  Philip     Cramer
36    Paul    Henriot

### Hint:

In SQL the syntax is:

```sql
SELECT
    emp_id,
    fname,
    lname
FROM
    employee
WHERE
    (fname LIKE 'P%' 
    OR lname LIKE 'P%') 
    AND emp_id LIKE '%M';
```

## 8. Select all books that have an "ing" in the title, with at least 4 other characters preceding it. 
For example, 'cooking' has 4 characters before the
   'ing', so this should be included; 'sewing' has only 3 characters before the
   'ing', so this shouldn't be included.

In [ ]:
(
titles
    # within a regular expression, '.' is a wildcard character 
    # which can take the value of any - and any number of - characters.
    .loc[titles['title'].str.contains('....ing', regex=True)]
)

,title_id,title,type,pub_id,price,advance,royalty,ytd_sales,notes,pubdate
1,BU1111,Cooking with Computers: Surreptitious Balance ...,business,1389,11.95,5000.0,10,3876,Helpful hints on how to use your electronic re...,1991-06-09 00:00:00
6,MC3026,The Psychology of Computer Cooking,UNDECIDED,877,0.00,0.0,0,0,NaN,2014-11-07 10:39:37
15,TC3218,"Onions, Leeks, and Garlic: Cooking Secrets of ...",trad_cook,877,20.95,7000.0,10,375,"Profusely illustrated in color, this makes a w...",1991-10-21 00:00:00
16,TC4203,Fifty Years in Buckingham Palace Kitchens,trad_cook,877,11.95,4000.0,14,15096,More anecdotes from the Queen's favorite cook ...,1991-06-12 00:00:00

### Hint:

In SQL the syntax is:

```sql
SELECT title
FROM titles
WHERE title LIKE "%____ing%";
```